'''
......
......
......
......
......
......
......
......
.Y....
.YG...
RRYG..
RRYGG.
'''
lines = [list(map(str, input().strip())) for _ in range(12)]

'''
    ㅣ ㅡ ㅏ ㅓ ㅗ ㅜ ┌ ┐ ┘ └ ㅁ
    0 아래 3개 / 1 오른쪽 3개 / 2 아래 2개, 아래 오른쪽 1개 / 3 아래 2개, 아래 왼쪽 1개 /
    4 아래 1개, 아래 왼쪽 1개, 아래 오른쪽 1개 / 5 오른쪽 2개, 아래 오른쪽 1개 /
    6 아래 2개, 오른쪽 1개 / 7 아래 1개 오른쪽 2개 / 8 오른쪽 2개, 오른쪽 오른쪽 아래 1개 /
    9 오른쪽 1개, 오른쪽 아래 2개 / 10 아래 1개, 아래 왼쪽 2개 / 11 아래 2개, 아래 왼쪽 1개 / 12 아래 2개, 아래아래 오른쪽 1개 / 13 아래 1개, 아래 오른쪽 2개 / 
    14 오른쪽 1개, 아래쪽 1개, 오른쪽 아래 1개
'''

color_list = ['R', 'Y', 'G', 'B', 'P']
event = {
    0 : [(0,1), (0,2), (0,3)],
    1 : [(1,0), (2,0), (3,0)],
    2 : [(1,0), (2,0), (1,1)],
    3 : [(1,0), (2,0), (1,-1)],
    4 : [(1,0), (1,-1), (1,1)],
    5 : [(0,1), (0,2), (1,1)],
    6 : [(1,0), (2,0), (0,1)],
    7 : [(1,0), (0,1), (0,2)],
    8 : [(0,1), (0,2), (1,2)],
    9 : [(0,1), (1,1), (2,1)],
    10 : [(1,0), (1,-1), (1, -2)],
    11 : [(1,0), (2,0), (2,-1)],
    12 : [(1,0), (2,0), (2,1)],
    13 : [(1,0), (1,1), (1,2)],
    14 : [(1,0), (0,1), (1,1)]
}

change_position = {
    0 : [(-4,0), (-4,0), (-4,0), (-4,0)],
    1 : [(-1,0), (-1,0), (-1,0), (-1,0)],
    2 : [(-3,0), (-3,0), (-3,0), (-1,0)],
    3 : [(-3,0), (-3,0), (-3,0), (-1,0)],
    4 : [(-2,0), (-2,0), (-1,0), (-1,0)],
    5 : [(-2,0), (-2,0), (-1,0), (-1,0)],
    6 : [(-3,0), (-3,0), (-3,0), (-1,0)],
    7 : [(-2,0), (-2,0), (-1,0), (-1,0)],
    8 : [(-1,0), (-1,0), (-2,0), (-2,0)],
    9 : [(-1,0), (-3,0), (-3,0), (-3,0)],
    10 : [(-2,0), (-2,0), (-1,0), (-1,0)],
    11 : [(-3,0), (-3,0), (-3,0), (-1,0)],
    12 : [(-3,0), (-3,0), (-3,0), (-1,0)],
    13 : [(-2,0), (-2,0), (-1,0), (-1,0)],
    14 : [(-2,0), (-2,0), (-2,0), (-2,0)]
}


i = 0
j = 0
count = 0

while i <= 11:
    while j <= 5:
        if lines[i][j] == '.':
            # print(f'.인 현재 위치 : {i} {j}')
            if j == 5:
                j = 0
                i += 1
                break
            else:
                j += 1
                break

        change = 0
        for num in event.values():
            # print(f'딕셔너리 번호 : {num}')
            comparison = []
            position = []
            # print(f'.인 현재 위치 : {i} {j}')
            comparison.append(lines[i][j])
            position.append([i, j, 0, 0])
            for r, c in num:
                nr = i + r
                nc = j + c
                # print(f'새로운 위치 : {nr} {nc}')
                if 0 <= nr <= 11 and 0 <= nc <= 5 :
                    if comparison[0] == lines[nr][nc]:
                        comparison.append(lines[nr][nc])
                        position.append([nr, nc, r, c])

            if len(comparison) == 4:
                count += 1
                change += 1
                print(f'현재 위치 : {i} {j}')
                print(f'count 추가 : {count}')
                for r, c, m_r, m_c in position:
                    lines[r][c] = lines[r-m_r][c-m_c]
                    lines[r - m_r][c - m_c] = '.'
                print(lines[i])

        if change != 0:
            continue

        elif j < 5:
            j += 1
            continue
        else:
            j = 0
            i += 1
            continue

print(count)